In [2]:
import pandas as pd
import numpy as np

In [3]:
splitwiseData = pd.read_csv('splitwise_group.csv')

In [4]:
splitwiseData.head()

,Date,Description,Category,Cost,Currency,Saviour Tom,Noble George,Jestin,Abin K Antony
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018-04-17,Washing machine,Home - Other,4340.0,INR,0.0,-1446.67,723.34,723.33
2,2018-04-19,Fried Chicken,Groceries,269.0,INR,0.0,134.50,-134.50,0.00
3,2018-04-21,Dinner,Dining out,125.0,INR,0.0,-41.67,-41.67,83.34
4,2018-04-22,Moriz,General,891.0,INR,0.0,523.00,-368.00,-155.00

In [5]:
splitwiseData = splitwiseData.dropna()

In [6]:
splitwiseData.isnull().sum()

Date             0
Description      0
Category         0
Cost             0
Currency         0
Saviour Tom      0
Noble George     0
Jestin           0
Abin K Antony    0
dtype: int64

In [7]:
splitwiseData.dtypes

Date              object
Description       object
Category          object
Cost             float64
Currency          object
Saviour Tom      float64
Noble George     float64
Jestin           float64
Abin K Antony    float64
dtype: object

In [8]:
splitwiseData['Date'] = pd.to_datetime(splitwiseData['Date'])

In [9]:
splitwiseData.dtypes

Date             datetime64[ns]
Description              object
Category                 object
Cost                    float64
Currency                 object
Saviour Tom             float64
Noble George            float64
Jestin                  float64
Abin K Antony           float64
dtype: object

In [10]:
splitwiseData = splitwiseData.drop(['Description', 'Currency'], axis=1)

In [11]:
splitwiseData.head()

,Date,Category,Cost,Saviour Tom,Noble George,Jestin,Abin K Antony
1,2018-04-17,Home - Other,4340.0,0.0,-1446.67,723.34,723.33
2,2018-04-19,Groceries,269.0,0.0,134.50,-134.50,0.00
3,2018-04-21,Dining out,125.0,0.0,-41.67,-41.67,83.34
4,2018-04-22,General,891.0,0.0,523.00,-368.00,-155.00
5,2018-04-25,Dining out,165.0,0.0,82.50,0.00,-82.50